#include <math.h>
#include <stdio.h>

int main() {
	float e, r_i, r_1, r_2, r_3, r_4, r_5, r_6, r_4_6, r_3_6, r, i, i_1, i_2, i_3, i_4, i_5, i_6, u_3_6, u_4_6, u_3, p_0, p_i, p_n;

	e = 20.00;
	r_i = 2.00;
	r_1 = 9.00;
	r_2 = 6.00;
	r_3 = 12.00;
	r_4 = 1.00;
	r_5 = 2.00;
	r_6 =1.00;

	// Вычисление сопротивления
	r_4_6 = r_4 + r_5 + r_6;
	r_3_6 = (r_3 * r_4_6) / (r_3 + r_4_6);
	r = r_1 + r_3_6 + r_2;

	// Вычисление токов
	i = e / (r + r_i);
	i_2 = i_3 = i_1 = i;

	u_3_6 = i * r_3_6;
	u_4_6 = u_3 = u_3_6;

	i_3 = u_3/r_3;
	i_4 = i_5 = i_6 = u_4_6 / r_4_6;

	// Проверка правильности решения
	p_i = e*i;
	p_0 = pow(i,2) *r_i;
	p_n = pow(i_1, 2)*r_1 + pow(i_2, 2)*r_2 + pow(i_3, 2)*r_3 + pow(i_4, 2)*r_4 + pow(i_5, 2)*r_5 + pow(i_6, 2)*r_6;

	printf("I_1 = %f; I_2 = %f; I_3 = %f; I_4 = %f; I_5 = %f; I_6 = %f;\n", i_1, i_2, i_3, i_4, i_5, i_6);

	printf("Проверка правильности решения:\nP_I = %f, P_0 = %f, P_N = %f\n", p_i, p_0, p_n);

	return 0;
}